{
    "id": 4,
    "name": "Slytherin",
    "image": "/Images/Houses/Slytherin.png",
    "house_quote": " 'You'll make your real friends in Slytherin, those cunning folk use any means, To achieve their ends.' - Sorting Hat",
    "founder": "Salazar Slytherin",
    "house_colors": ["Green", "Silver"],
    "animal": "Serpent",
    "element": "Water",
    "traits": ["Ambition", "Cunning", "Resourcefulness", "Determination","Pride","Self-preservation","Shrewdness"],
    "head": ["Horace Slughorn","Severus Snape","Salazar Slytherin","Abraham Ronen"],
    "ghost": "The Bloody Baron",
    "common_room": "Dungeons (under the lake)",
    "notable_members": [
      "Tom Riddle (Voldemort)",
      "Severus Snape",
      "Draco Malfoy",
      "Horace Slughorn",
      "Peter Pettigrew",
      "Albus Severus Potter",
      "Scorpius Malfoy"
    ],
    
    "description":{
        "introduction": "Salazar Slytherin, one of Hogwarts' four founders, was a controversial proponent of pure-blood supremacy who believed Muggle-borns were unworthy to study magic - a view shaped by the medieval persecution of witches by Muggles. His radical stance destroyed his friendship with Godric Gryffindor, nearly sparking either a duel between the founders or a civil war among their students according to the Sorting Hat. After failing to convince his peers, Slytherin left Hogwarts but secretly built the Chamber of Secrets, concealing within it a deadly basilisk meant to purge the school of Muggle-borns when his heir would eventually open it. The chamber was opened twice in history, with Harry Potter famously slaying the basilisk in 1993. Slytherin House continues his legacy, valuing ambition, cunning, resourcefulness and leadership, as exemplified by influential student groups like Draco Malfoy's gang and Tom Riddle's Death Eaters. While the Sorting Hat acknowledges blood status can influence placement, Muggle-born Slytherins remain exceptionally rare. The house has been led by notable figures including Severus Snape and Horace Slughorn, with the Bloody Baron - who murdered Rowena Ravenclaw's daughter - serving as its ghost. This dark history fuels Slytherin's enduring rivalry with Gryffindor, making their conflict the most intense inter-house competition at Hogwarts.",

        "traits":{
            
            "information":"Slytherins are known for their shrewdness, self-preservation instincts, and ability to carefully weigh outcomes before acting. While the Sorting Hat considers blood purity as a factor due to Slytherin's pure-blood supremacy beliefs, it's not the sole determinant - notable half-bloods like Severus Snape and Tom Riddle were sorted here, though Muggle-born Slytherins remain exceptionally rare. The house has produced both dark wizards and progressive figures like Merlin, who championed Muggle rights. Slytherins demonstrate intense loyalty and remarkable capacity for deep, often unrequited love, as seen in Snape's lifelong devotion to Lily Evans and the Bloody Baron's tragic obsession with Helena Ravenclaw. Slytherin maintains a fierce rivalry with Gryffindor, rooted in the founders' ideological clash over blood status admissions. This animosity persisted through the centuries, manifesting in Quidditch competitions (where Slytherin dominated for six years before Harry Potter's arrival) and social tensions. During the Wizarding Wars, no Slytherins joined Dumbledore's Army, though this partly reflected Gryffindor leaders' distrust rather than universal house alignment. The house's complex legacy includes both its founder's controversial Chamber of Secrets (designed to purge Muggle-borns) and its members' significant contributions to magical society. Current head Horace Slughorn and patron ghost the Bloody Baron oversee a house that continues to attract ambitious, determined students who value tradition while navigating the modern wizarding world's changing values."
        },

        "reputation":{
                "quote":" 'There's not a single witch or wizard who went bad who wasn't in Slytherin.'",

                "information":"Slytherin House has long been associated with Dark witches and wizards, though this reputation is more nuanced than commonly believed. While it's true that many notorious dark practitioners including Voldemort and numerous Death Eaters came from Slytherin, it's inaccurate to claim all dark wizards belonged to this house - history shows Peter Pettigrew (Gryffindor), Quirinus Quirrell (Ravenclaw), and even an alternate-reality Cedric Diggory (Hufflepuff) also turned to dark magic. This association stems partly from Salazar Slytherin's pure-blood ideology and Voldemort's strategic recruitment from traditional Slytherin families, but the house has also produced remarkable heroes who defied expectations. Figures like Merlin (who championed Muggle rights), Severus Snape (whose courageous double life protected Harry Potter), Andromeda Tonks (who rejected her dark-aligned family), and Regulus Black (who sacrificed himself to destroy a Horcrux) demonstrate Slytherin's capacity for nobility. During the Battle of Hogwarts, while Slytherins were initially evacuated, many returned with Horace Slughorn to fight against Voldemort, challenging the stereotype of universal cowardice or dark allegiance. The Sorting Hat's process remains debated - while it primarily selects for ambition and cunning, some suggest it may place those with dark tendencies in Slytherin regardless of other traits, as possibly occurred with less clever students like Crabbe and Goyle. This practice, combined with historical associations, has fostered unfair prejudice against all Slytherins. Ultimately, while the house produced more Dark wizards than others, most members were ordinary witches and wizards, and Slytherin traits like ambition and self-preservation are morally neutral - their value determined by how they're applied. The house's complex legacy continues evolving in the post-Voldemort era, blending dark reputation with unsung heroism in a way that defies simple categorization."
        },

        "common_room":{
            "common_houseroom":"The Slytherin common room was in the dungeons of Hogwarts Castle and underneath the Black Lake. Because of this, the light in the common room was green. Harry Potter along with Ron Weasley entered the common room in his second year to find out if Draco Malfoy was the one opening the Chamber of Secrets. To enter the Slytherin common room one must merely speak aloud the current password in front of a stretch of a damp stone wall; once the word was uttered a concealed stone door would slide aside leaving a rectangular hole in the wall leading to the Slytherin common room. The only known Slytherin passwords were 'aspiration', used in 1890, and 'pureblood', used in 1992."

        }
    },

    "internal_image":
    { 
        "founder":
        {
            "url": "/Images/HouseIdsImage/SHouse/founder.png",
            "caption": "Salazar Slytherin - Founder of Slytherin House"
        },

        "trait":
        {
            "url": "/Images/HouseIdsImage/SHouse/SLogo.jpg",
            "caption": "Slytherin Logo"
        },

        "common_room":
        {
            "url": "/Images/HouseIdsImage/SHouse/common_room.png",
            "caption": "Slytherin Common Room"
        },

        "ghost":
        {
            "url": "/Images/HouseIdsImage/SHouse/ghost.png",
            "caption": "The Bloody Baron - Slytherin House Ghost"
        }
  }

}
